[
    {
        "bookId": 1,
        "bookName": "The Dating Playbook for Men",
        "author": "Andrew Ferebee",
        "images": "https://i.ibb.co/7bzLC47/The-dating-playbook.png",
        "review": "The Dating Playbook for Men is an insightful guide offering practical strategies for men to navigate the complexities of dating. With a focus on self-improvement and authenticity, Andrew Ferebee provides actionable advice to help readers build confidence and cultivate meaningful connections. While primarily targeting heterosexual dynamics, its principles remain valuable for anyone seeking to enhance their dating experiences. Overall, a recommended read for those looking to up their dating game.",
        "totalPages": 188,
        "rating": 4.4,
        "category": "Dating",
        "tags": [
            "phycology",
            "suspension"
        ],
        "publisher": "Knowledge for Men",
        "yearOfPublishing": "2015"
    },
    {
        "bookId": 2,
        "bookName": "Why Do You Hate Money",
        "author": "Joey Percia",
        "images": "https://i.ibb.co/ZYYFYrC/kindpng-7318921.png",
        "review": "Why Do You Hate Money by bestselling author Peter H. Diamandis and Steven Kotler is a compelling exploration of the changing landscape of wealth and abundance. Through insightful analysis and real-world examples, the book challenges traditional notions of scarcity and offers a paradigm-shifting perspective on the relationship between money and fulfillment. With practical strategies for leveraging exponential technologies and abundance mindsets, it's a must-read for anyone seeking to thrive in the age of abundance.",
        "totalPages": 228,
        "rating": 4.7,
        "category": "fitness marketing",
        "tags": [
            "fitness marketing",
            "Money"
        ],
        "publisher": "BenBella Books",
        "yearOfPublishing": "2017"
    },
    {
        "bookId": 3,
        "bookName": "The Hate U Give",
        "author": "Angie Thomas",
        "images": "https://i.ibb.co/6XGVjNP/kindpng-1064993.png",
        "review": "The Hate U Give by Angie Thomas is a poignant and powerful novel that addresses issues of race, identity, and social justice with remarkable depth and honesty. Through the eyes of protagonist Starr Carter, Thomas navigates the complexities of systemic racism and police brutality, offering readers a gripping and thought-provoking narrative. With its compelling characters and emotionally resonant storytelling, 'The Hate U Give' is a timely and essential read that inspires empathy and sparks important conversations about race and inequality in contemporary society.",
        "totalPages": 444,
        "rating": 4.5,
        "category": "drama",
        "tags": [
            "drama",
            "Film"
        ],
        "publisher": "Balzer + Bray",
        "yearOfPublishing": "2017"
    },
    {
        "bookId": 4,
        "bookName": "Scholarship Monthly Planner",
        "author": "Marianne Ragins",
        "images": "https://i.ibb.co/Vv9TFgm/kindpng-4022054-1.png",
        "review": " The Scholarship Monthly Planner is a comprehensive tool that adeptly organizes the complex process of scholarship applications. Its intuitive layout and systematic approach streamline the often daunting task of researching, applying, and tracking scholarships. With detailed prompts and timelines for each step, it empowers students to efficiently navigate the competitive landscape of scholarship opportunities. From deadlines to essay prompts, this planner equips students with the resources they need to maximize their chances of success in securing financial aid for their education.",
        "totalPages": 28,
        "rating": 4.9,
        "category": "Study",
        "tags": [
            "Studey",
            "Scholarship"
        ],
        "publisher": "Organization",
        "yearOfPublishing": "2022"
    },
    {
        "bookId": 5,
        "bookName": "Loving Jesus More",
        "author": "Philip Graham Ryken",
        "images": "https://i.ibb.co/YcpSSPt/kindpng-2193744-1.png",
        "review": "Loving Jesus More captivates readers with its profound exploration of spiritual devotion and personal growth. Through heartfelt anecdotes and insightful reflections, the book offers a transformative journey towards a deeper connection with Christ. Its practical wisdom and genuine sincerity inspire readers to rekindle their love for Jesus and pursue a more fulfilling relationship with Him. A compelling read for anyone seeking to strengthen their faith and experience the boundless love of Christ in their lives.",
        "totalPages": 176,
        "rating": 4.5,
        "category": "God's love",
        "tags": [
            "God's love",
            "Love"
        ],
        "publisher": "Harvest House Publishers.",
        "yearOfPublishing": "2014"
    },
    {
        "bookId": 6,
        "bookName": "Spine of the Dragon",
        "author": " Kevin J. Anderson",
        "images": "https://i.ibb.co/2jggR4L/kindpng-4945926-1.png",
        "review": "Spine of the Dragon is a mesmerizing epic that seamlessly weaves together fantasy and adventure. With intricate world-building and dynamic characters, the novel transports readers to a realm filled with magic and danger. Its gripping plot twists and richly drawn landscapes will keep you turning the pages until the very end. A must-read for fans of high fantasy seeking a thrilling and immersive journey.",
        "totalPages": 519,
        "rating": 4.8,
        "category": "vengeance",
        "tags": [
            "sorcery",
            "vengeance"
        ],
        "publisher": "Tor Books",
        "yearOfPublishing": "2019"
    }
]